---
kind: other
id: Methods.T:Autodesk.Revit.DB.Plumbing.PipingSystem
source: html/aae576e9-abd8-99e7-1f86-286d86879edd.htm
---
# PipingSystem Methods

Add elements into the system and connect them with the system using given connectors.